FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ЗаказыАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыАвтомобилей</Name>
			<Comment>Заказы автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество автомобилей по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированных автомобилей по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервированиеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ЗаказыАвтомобилей/Ext/RecordSetModule.bsl
Перем РежимПроведения Экспорт; // Режим проведения документа. Если проведение неоперативное - проверок остатков нет

Перем ДокументОбъект Экспорт; //Документ, осуществляющий движение по регистру
Перем РезультатЗапросаПоАвтомобилям Экспорт; //Выборка табличной части или таблица значений табличной части автомобилей
Перем Заказ Экспорт; //Ссылка на документ ЗаказНаАвтомобиль. Если значение неопределено заказ находится в табличной части

Перем Приходовать Экспорт; // Булево. Истина - надо приходовать заказ на автомобиль
Перем Резервировать Экспорт; // Булево. Истина - надо резервировать автомобиль под заказ

// Возвращает результат запроса по таблице автомобилей
Функция ПолучитьТаблицуАвтомобилей()
	// получим результат запроса по таблице автомобилей
	ВидДок=ДокументОбъект.Метаданные().Имя;
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументАвтомобили.СуммаВсего КАК Сумма,
	|	"+?(Приходовать,"ДокументАвтомобили.Количество КАК Количество,","")+"
	|	"+?(Резервировать,"ДокументАвтомобили.Резерв КАК Резерв,","")+"
	|	"+?(Заказ=Неопределено,"ДокументАвтомобили.Заказ","&Заказ")+" КАК Заказ
	|ИЗ
	|	Документ."+ВидДок+".Автомобили КАК ДокументАвтомобили
	|ГДЕ
	|	ДокументАвтомобили.Ссылка=&Ссылка
	|";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Возврат Запрос.Выполнить();
КонецФункции

// Формирует движения по регистру приход (регистрируем заказ)
// Возвращаемое значение: Булево. Истина - все хорошо, Ложь - чего-то не так.
Функция Приход() Экспорт
	ВсеОК=Истина;

	Приходовать=?(Приходовать=Неопределено,Истина,Приходовать);
	Резервировать=?(Резервировать=Неопределено,Ложь,Резервировать);
	
	// получим таблицу автомобилей
	Если (РезультатЗапросаПоАвтомобилям=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоАвтомобилям=ПолучитьТаблицуАвтомобилей();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоАвтомобилям=РезультатЗапросаПоАвтомобилям.Выгрузить();
	КонецЕсли;

	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
	Попытка
		КурсУпр=ДокументОбъект.КурсВалютыУпр;
	Исключение
		КурсУпр=Неопределено;
	КонецПопытки; 
	Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ДокументОбъект.Дата);
		КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;

	//Перебираем строки товаров
	Для каждого СтрокаАвтомобилей Из РезультатЗапросаПоАвтомобилям Цикл
		ЗаказЗаказа=?(Заказ=Неопределено,СтрокаАвтомобилей.Заказ,Заказ);
		СуммаУпр=обПересчет(СтрокаАвтомобилей.Сумма,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаУпр,КурсУпр);
		// Создаем запись регистра заказов
		НоваяЗапись=Добавить();
		НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период=ДокументОбъект.Дата;
		НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
		НоваяЗапись.Заказ=ЗаказЗаказа;
		НоваяЗапись.Количество=?(Приходовать,СтрокаАвтомобилей.Количество,0);
		НоваяЗапись.Резерв=?(Резервировать,СтрокаАвтомобилей.Резерв,0);
		НоваяЗапись.СуммаУпр=Окр(СуммаУпр,2);
		НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
	КонецЦикла; 
	
	// запись движений
	Если ВсеОК Тогда Записать(); КонецЕсли; 
	
	РезультатЗапросаПоАвтомобилям=Неопределено;
	Заказ=Неопределено;
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	
	Возврат ВсеОК;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()

////////////////////////////////////////////////////////////////////////
//Инициализация переменных модуля набора записей
РежимПроведения=РежимПроведенияДокумента.Оперативный;
ДокументОбъект=Неопределено; // !!! Обязательный к заполнению перед началом проведения
РезультатЗапросаПоАвтомобилям=Неопределено;
Заказ=Неопределено;
